src/ЗУП/cfe/рг_УниверсальныйОбменXML/Catalogs/рг_НастройкиОбменаXML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рг_НастройкиОбменаXML</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксБазыПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОбменаДанными</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаПравил</Name>
					<Comment>deprecated (v2)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРасписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ЗУП/cfe/рг_УниверсальныйОбменXML/Catalogs/рг_НастройкиОбменаXML/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// ВдовинПЮ: Подсистема универсального обмена XML между ИБ 1С через веб-сервис и правила в макетах +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПарольИзменен = Ложь;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПрочитатьПароль();
	КонецЕсли;
	
	Расписание = ПолучитьРасписаниеИзОбъектаИлиЗадания();
	ПравилаОбменаДанными = ПолучитьПравилаОбменаИзОбъекта();
	
	// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище
	рг_УниверсальныйОбменXMLСервер.ЗаполнитьСписокСтатусов(СписокСтатусов);
	УстановитьВидимостьГруппПоРоли();
	ОбновитьИндикаторПравилЗагружены();
	// --- Вдовин П.Ю.
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПарольДействительноИзменен = ПарольИзменен И Пароль <> Строка(УникальныйИдентификатор);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПарольИзменен", ПарольДействительноИзменен);
	
	Если ПарольДействительноИзменен Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Пароль", Пароль);
	КонецЕсли;
	
	ТекущийОбъект.Расписание = Новый ХранилищеЗначения(Расписание);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Расписание", Расписание);
	ТекущийОбъект.ПравилаОбменаДанными = ПравилаОбменаДанными;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьОтображениеПароляПослеЗаписи();
	
КонецПроцедуры
// ВдовинПЮ: ---

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВдовинПЮ: Подсистема универсального обмена XML между ИБ 1С через веб-сервис и правила в макетах +++
&НаКлиенте
Процедура РасписаниеРегламентногоОбмена(Команда)
	
	РасписаниеРегламентногоЗадания = ПолучитьРасписаниеНаСервере();
	Обработчик = Новый ОписаниеОповещения("ПослеИзмененияРасписания", ЭтотОбъект);
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	ДиалогРасписания.Показать(Обработчик);
	
КонецПроцедуры
// ВдовинПЮ: ---

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ВдовинПЮ: Подсистема универсального обмена XML между ИБ 1С через веб-сервис и правила в макетах +++
&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПарольИзменен = Истина;
	
КонецПроцедуры
// ВдовинПЮ: ---

// ВдовинПЮ: Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище +++
&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	
	УстановитьВидимостьГруппПоРоли();
	
КонецПроцедуры
// ВдовинПЮ: ---

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ВдовинПЮ: Подсистема универсального обмена XML между ИБ 1С через веб-сервис и правила в макетах +++
&НаКлиенте
Процедура ПослеИзмененияРасписания(РасписаниеРезультат, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеРезультат <> Неопределено Тогда
		УстановитьРасписаниеНаСервере(РасписаниеРезультат);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписаниеНаСервере()
	
	Если РасписаниеЗаполнено(Расписание) Тогда
		Возврат Расписание;
	КонецЕсли;
	
	Возврат ПолучитьРасписаниеИзОбъектаИлиЗадания();
	
КонецФункции

&НаСервере
Процедура УстановитьРасписаниеНаСервере(РасписаниеРегламентногоЗадания)
	
	Расписание = РасписаниеРегламентногоЗадания;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПароль()
	
	УстановитьПривилегированныйРежим(Истина);
	ПарольИзХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка, "Пароль");
	УстановитьПривилегированныйРежим(Ложь);
	
	Пароль = ?(ЗначениеЗаполнено(ПарольИзХранилища), Строка(УникальныйИдентификатор), "");
	ПарольИзменен = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПароляПослеЗаписи()
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПрочитатьПароль();
	Иначе
		Пароль = "";
		ПарольИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписаниеИзОбъектаИлиЗадания()
	
	СсылкаДляЧтенияРасписания = Неопределено;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		СсылкаДляЧтенияРасписания = Объект.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		СсылкаДляЧтенияРасписания = Параметры.ЗначениеКопирования;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаДляЧтенияРасписания) Тогда
		РасписаниеИзОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаДляЧтенияРасписания, "Расписание");
		Если ЗначениеЗаполнено(РасписаниеИзОбъекта) Тогда
			РасписаниеИзХранилища = РасписаниеИзОбъекта.Получить();
			Если РасписаниеЗаполнено(РасписаниеИзХранилища) Тогда
				Возврат РасписаниеИзХранилища;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИдентификаторЗадания = Объект.ИндентификаторРегламентногоЗадания;
	Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Возврат Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Задание = РегламентныеЗаданияСервер.Задание(ИдентификаторЗадания);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Задание <> Неопределено Тогда
		Возврат Задание.Расписание;
	КонецЕсли;
	
	Возврат Новый РасписаниеРегламентногоЗадания;
	
КонецФункции

&НаСервере
Функция РасписаниеЗаполнено(РасписаниеЗначение)
	
	Если РасписаниеЗначение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПустоеРасписание = Новый РасписаниеРегламентногоЗадания;
	Возврат Строка(РасписаниеЗначение) <> Строка(ПустоеРасписание);
	
КонецФункции
// ВдовинПЮ: ---

// ВдовинПЮ: Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище +++
&НаКлиенте
Процедура ЗагрузитьПравилаИзФайла(Команда)
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("Заголовок", НСтр("ru = 'Выберите файл правил обмена'"));
	ПараметрыДиалога.Вставить("Фильтр", НСтр("ru = 'Файлы правил (*.xml)'") + "|*.xml");
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьПравилаИзФайлаЗавершение", ЭтотОбъект);
	ОбменДаннымиКлиент.ВыбратьИПередатьФайлНаСервер(Оповещение, ПараметрыДиалога, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПравилаИзФайлаЗавершение(РезультатПомещения, ДополнительныеПараметры) Экспорт
	
	Если РезультатПомещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(РезультатПомещения.ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПомещения.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(РезультатПомещения.Хранение) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не удалось передать файл правил на сервер.'"));
		Возврат;
	КонецЕсли;
	
	ЧастиИмени = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(РезультатПомещения.Имя);
	Если НРег(ЧастиИмени.Расширение) <> ".xml" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Файл правил обмена должен иметь расширение xml.'"));
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗагрузитьПравилаИзФайлаНаСервере(РезультатПомещения.Хранение);
		Модифицированность = Истина;
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппПоРоли()
	
	ЭтоИсточник = Объект.Источник;
	
	Элементы.ГруппаИсточник.Видимость = ЭтоИсточник;
	Элементы.ГруппаПриемник.Видимость = НЕ ЭтоИсточник;
	
	// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище
	ОбновитьОтображениеСтатусаИКоманд();
	// --- Вдовин П.Ю.
	
	//Элементы.АдресСервиса.Видимость = НЕ ЭтоИсточник;
	//Элементы.Логин.Видимость = НЕ ЭтоИсточник;
	//Элементы.Пароль.Видимость = НЕ ЭтоИсточник;
	//Элементы.ИспользоватьРасписание.Видимость = НЕ ЭтоИсточник;
	//Элементы.ИндентификаторРегламентногоЗадания.Видимость = НЕ ЭтоИсточник;
	//Элементы.ФормаРасписаниеРегламентногоОбмена.Видимость = НЕ ЭтоИсточник;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПравилаИзФайлаНаСервере(АдресВременногоХранилища)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ТекстПравил = ТекстПравилОбменаИзДвоичныхДанных(ДвоичныеДанные);
	ПравилаОбменаДанными = Новый ХранилищеЗначения(ТекстПравил);
	
	ОбновитьИндикаторПравилЗагружены();
	
КонецПроцедуры

&НаСервере
Функция ТекстПравилОбменаИзДвоичныхДанных(ДвоичныеДанные)
	
	Если ДвоичныеДанные = Неопределено ИЛИ ДвоичныеДанные.Размер() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Файл правил обмена пуст.'");
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяВременногоФайла, КодировкаТекста.UTF8);
	ТекстПравил = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);
	
	Если ПустаяСтрока(СокрЛП(ТекстПравил)) Тогда
		ВызватьИсключение НСтр("ru = 'Файл правил обмена не содержит данных.'");
	КонецЕсли;
	
	Возврат ТекстПравил;
	
КонецФункции

&НаСервере
Процедура ОбновитьИндикаторПравилЗагружены()
	
	Если ПравилаОбменаЗагружены() Тогда
		ТекстСтатуса = НСтр("ru = 'Загружены'");
	Иначе
		ТекстСтатуса = НСтр("ru = 'Не загружены'");
	КонецЕсли;
	
	Элементы.ПравилаЗагружены.Заголовок = ТекстСтатуса;
	Элементы.ПравилаЗагружены.ТолькоПросмотр = Истина;
	
	// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище
	ОбновитьОтображениеСтатусаИКоманд();
	// --- Вдовин П.Ю.
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПравилаОбменаИзОбъекта()
	
	СсылкаДляЧтения = Неопределено;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		СсылкаДляЧтения = Объект.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		СсылкаДляЧтения = Параметры.ЗначениеКопирования;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СсылкаДляЧтения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаДляЧтения, "ПравилаОбменаДанными");
	
КонецФункции

&НаСервере
Функция ПравилаОбменаЗагружены()
	
	Если НЕ ЗначениеЗаполнено(ПравилаОбменаДанными) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СодержимоеПравил = ПравилаОбменаДанными.Получить();
	
	Если ТипЗнч(СодержимоеПравил) = Тип("Строка") Тогда
		Возврат НЕ ПустаяСтрока(СокрЛП(СодержимоеПравил));
	КонецЕсли;
	
	Если ТипЗнч(СодержимоеПравил) = Тип("ДвоичныеДанные") Тогда
		Возврат СодержимоеПравил.Размер() > 0;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(СодержимоеПравил);
	
КонецФункции

// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище
&НаКлиенте
Процедура ПодготовитьКОбмену(Команда)
	
	Попытка
		Если НЕ ПодготовитьКОбменуНаСервере() Тогда
			Возврат;
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОбмен(Команда)
	
	Если СтатусПрофиляВыполняетсяНаСервере() Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОтменитьОбменПослеПодтверждения", ЭтотОбъект);
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'Сеанс в статусе ""Идёт обмен"". Сбросить готовность?'"),
			РежимДиалогаВопрос.ДаНет,
			,
			КодВозвратаДиалога.Нет);
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОтменуОбменаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОбменПослеПодтверждения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОтменуОбменаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтменуОбменаНаКлиенте()
	
	Попытка
		Если НЕ ОтменитьОбменНаСервере() Тогда
			Возврат;
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьКОбменуНаСервере()
	
	КодСтатуса = рг_УниверсальныйОбменXMLСервер.СтатусНовое();
	ЭлементСписка = СписокСтатусов.НайтиПоЗначению(КодСтатуса);
	
	Если ЭлементСписка = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не найден код статуса «Готов к обмену» в списке значений формы.'");
	КонецЕсли;
	
	Объект.Статус = ЭлементСписка.Значение;
	
	Возврат ЗаписатьОбъектФормы();
	
КонецФункции

&НаСервере
Функция ОтменитьОбменНаСервере()
	
	КодСтатуса = рг_УниверсальныйОбменXMLСервер.СтатусНеГотов();
	ЭлементСписка = СписокСтатусов.НайтиПоЗначению(КодСтатуса);
	
	Если ЭлементСписка = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не найден код статуса «Не готов к обмену» в списке значений формы.'");
	КонецЕсли;
	
	Объект.Статус = ЭлементСписка.Значение;
	
	Возврат ЗаписатьОбъектФормы();
	
КонецФункции

&НаСервере
Функция СтатусПрофиляВыполняетсяНаСервере()
	
	Возврат КодСтатусаПрофиляНаФорме() = рг_УниверсальныйОбменXMLСервер.СтатусВыполняется();
	
КонецФункции

&НаСервере
Функция ЗаписатьОбъектФормы()
	
	Отказ = Ложь;
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ПараметрыЗаписи = Новый Структура;
	ЭтоНовыйОбъект = ТекущийОбъект.Ссылка.Пустая();
	ОжидаемыйСтатус = ТекущийОбъект.Статус;
	
	ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ТекущийОбъект.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			"рг_УниверсальныйОбменXML.ЗаписьПрофиля",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.рг_НастройкиОбменаXML,
			ТекущийОбъект.Ссылка,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
	// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище
	Если ЭтоНовыйОбъект И ТекущийОбъект.Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтатусВБазе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "Статус");
	
	Если СтатусВБазе <> ОжидаемыйСтатус Тогда
		Возврат Ложь;
	КонецЕсли;
	// --- Вдовин П.Ю.
	
	ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	ОбновитьОтображениеСтатусаИКоманд();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОбновитьОтображениеСтатусаИКоманд()
	
	КодСтатуса = КодСтатусаПрофиляНаФорме();
	ПредставлениеСтатуса = рг_УниверсальныйОбменXMLСервер.ПредставлениеСтатуса(КодСтатуса);
	
	Элементы.Статус.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Статус: %1'"),
		ПредставлениеСтатуса);
	Элементы.Статус.ТолькоПросмотр = Истина;
	
	ЭтоИсточник = Объект.Источник;
	Элементы.ФормаПодготовитьКОбмену.Видимость = ЭтоИсточник;
	Элементы.ФормаОтменитьОбмен.Видимость = ЭтоИсточник;
	
	Если НЕ ЭтоИсточник Тогда
		Элементы.ФормаПодготовитьКОбмену.Доступность = Ложь;
		Элементы.ФормаОтменитьОбмен.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаПодготовитьКОбмену.Доступность = ДоступнаКомандаПодготовитьКОбмену(КодСтатуса);
	Элементы.ФормаОтменитьОбмен.Доступность = ДоступнаКомандаОтменитьОбмен(КодСтатуса);
	
КонецПроцедуры

&НаСервере
Функция КодСтатусаПрофиляНаФорме()
	
	Если ПустаяСтрока(Объект.Статус) Тогда
		Возврат рг_УниверсальныйОбменXMLСервер.СтатусНеГотов();
	КонецЕсли;
	
	Возврат Объект.Статус;
	
КонецФункции

&НаСервере
Функция ДоступнаКомандаПодготовитьКОбмену(КодСтатуса)
	
	СтатусДопускаетПодготовку = КодСтатуса = рг_УниверсальныйОбменXMLСервер.СтатусНеГотов()
		ИЛИ КодСтатуса = рг_УниверсальныйОбменXMLСервер.СтатусВыполнено()
		ИЛИ КодСтатуса = рг_УниверсальныйОбменXMLСервер.СтатусОшибка();
	
	Возврат СтатусДопускаетПодготовку
		И ПравилаОбменаЗагружены()
		И ЗначениеЗаполнено(Объект.Префикс)
		И ЗначениеЗаполнено(Объект.ПрефиксБазыПриемника);
	
КонецФункции

&НаСервере
Функция ДоступнаКомандаОтменитьОбмен(КодСтатуса)
	
	Возврат КодСтатуса = рг_УниверсальныйОбменXMLСервер.СтатусНовое()
		ИЛИ КодСтатуса = рг_УниверсальныйОбменXMLСервер.СтатусВыполняется();
	
КонецФункции
// --- Вдовин П.Ю.

#КонецОбласти
